/* eslint-disable jsx-a11y/alt-text */
import { useEffect, useState } from "react";
import Image from "next/image";
import { InView, useInView } from "react-intersection-observer";
import style from "./intro.module.scss";

export default function Intro() {
  const [index, setIndex] = useState(0);
  const list = [
    {
      id: 1,
      name: "জনাব কবির বিন আনোয়ার",
      designation:
        "জনাব কবির বিন আনোয়ার, সিনিয়র সচিব, পানি সম্পদ মন্ত্রণালয় ও  সভাপতি, বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন ",
      details:
        "জনাব কবির বিন আনোয়ার একজন ক্যারিয়ার সিভিল সার্ভেন্ট। তিনি বিসিএস (প্রশাসন) ক্যাডারের ৭ম ব্যাচের একজন কর্মকর্তা। তিনি ০১ জানুয়ারী ১৯৬৪ সালে সিরাজগঞ্জ জেলার একটি সম্ভ্রান্ত মুসলিম পরিবারে জন্ম গ্রহণ করেন। তাঁর বাবা আনোয়ার হোসেন রতু একজন বীর মুক্তিযোদ্ধা। তিনি পেশায় একজন ব্যবসায়ী হওয়া সত্বেও পেশাগত জীবনের পাশাপাশি তিনি বিভিন্ন আর্থ সামাজিক উন্নয়ন কর্মকান্ডের সঙ্গে জড়িত ছিলেন। জনাব কবির এর মা সৈয়দা ইসাবেলা ছিলেন ঐতিহাসিক মুক্তি সংগ্রামের একজন অন্যতম সংগঠক। তিনি পেশাগত জীবনে শিক্ষকতা করতেন। সেইসাথে, তিনি রচনা করেছেন ২২ টি বই। জনাব কবির এর মাতামহ সৈয়দা ইসহাক হোসাইন সিরাজী ছিলেন একটি উচ্চ বিদ্যালয়ের প্রধান শিক্ষক ও সঙ্গীতজ্ঞ। তিনি বিখ্যাত বাঙালী লেখক ও কবি সৈয়দ ইসমাইল হোসেন সিরাজী এর ভাই। তাঁর পিতামহ আব্দুস সামাদ মিয়া ছিলেন একজন আইনজীবী, তিনি তৎকালীন কলকাতা বিশ্ববিদ্যালয় থেকে স্নাতক ডিগ্রী অর্জন করেছিলেন। জনাব কবির বিন আনোয়ার এর সহধর্মীনি তৌফিকা আহমেদ। তারা ব্যক্তিগত জীবনে এক পুত্র ও দুই কন্যার অভিভাবক। জনাব কবির বিন আনোয়ার তাঁর স্কুল ও কলেজ জীবন সম্পন্ন করেন রেসিডেনসিয়াল মডেল স্কুল ও কলেজ, ঢাকা থেকে। এরপর তিনি ঢাকা বিশ্ববিদ্যালয়ে ভর্তি হন এবং রাষ্ট্রবিজ্ঞানে এমএ ডিগ্রী অর্জন করেন। পরবর্তীতে তিনি আইন শিক্ষার অভিপ্রায়ে এলএলবি ডিগ্রী অর্জন করেন। ",
      photo: "/images/intro/president.jpg",
    },
    {
      id: 2,
      name: "জনাব মোঃ খলিলুর রহমান",
      designation:
        "সচিব, ডাক ও টেলিযোগাযোগ বিভাগ ও মহাসচিব, বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
      details:
        "জনাব মোঃ খলিলুর রহমান ২৮ অক্টোবর, ২০২১ তারিখে ডাক ও টেলিযোগাযোগ বিভাগের সচিব হিসেবে যোগদান করেন এবং আজঅবধি তিনি এ বিভাগের দায়িত্ব পালন করছেন। এ বিভাগে যোগদানের পূর্বে তিনি বিভাগীয় কমিশনার, ঢাকা হিসেবে দায়িত্ব পালন করেন। শিক্ষা জীবন শেষে তিনি সহকারী কমিশনার ও ম্যাজিস্ট্রেট হিসেবে প্রশাসন ক্যাডারের একজন সদস্য হিসেবে ১৯৯৩ সালে জেলা প্রশাসকের কার্যালয়, নীলফামারি- তে যোগদান করেন। অতঃপর ভূমি ব্যবস্থাপনার গুরুত্বপূর্ণ পদ সহকারী কমিশনার ভূমি হিসেবে ডিমলা, নীলফামারী সদর, কোতয়ালী রাজস্ব সার্কেল, ঢাকা এবং সিঙ্গাইর, মানিকগঞ্জে দায়িত্ব পালন করেন। তিনি মাঠ প্রশাসনের গুরুত্বপূর্ণ পদ উপজেলা নির্বাহী অফিসার হিসেবে কেশবপুর, যশোর এবং চরভদ্রাসন, ফরিদপুর উপজেলায় দায়িত্ব পালন করেন। তিনি গোপালগঞ্জ জেলার জেলা প্রশাসক হিসাবে দীর্ঘ ৪ বছর দায়িত্ব পালন করেন। তিনি উপসচিব, গৃহায়ন ও গণপূর্ত মন্ত্রণালয় এবং উপপরিচালক, রাজউক, সহকারী ওয়াকফ প্রশাসক, ওয়াকফ প্রশাসন হিসাবে দায়িত্ব পালন করেছেন। মোঃ খলিলুর রহমান ১৮ অক্টোবর ২০১৬ তারিখে প্রধানমন্ত্রীর কার্যালয়ে পরিচালক ও ২৪ অক্টোবর, ২০১৯ তারিখে মহাপরিচালক (প্রশাসন) হিসাবে যোগদান করেন।",
      photo: "/images/intro/2.jpg",
    },
    {
      id: 3,
      name: "ডঃ দেওয়ান মুহাম্মদ হুমায়ূন কবীর",
      designation:
        "প্রকল্প পরিচালক (যুগ্মসচিব), এটুআই প্রোগ্রাম ও  আহবায়ক, পেশাগত দক্ষতা ও উন্নয়ন উপ-কমিটি   ",
      details:
        "ডঃ দেওয়ান মুহাম্মদ হুমায়ূন কবীর, যুগ্মসচিব বর্তমানে মন্ত্রিপরিষদ বিভাগের নির্দেশনায় ও ইউএনডিপির মদদপুষ্ট এটুআই প্রকল্প, তথ্য ও যোগাযোগ প্রযুক্তি বিভাগের প্রকল্প পরিচালক হিসেবে কর্মরত আছেন।         তিনি মাঠ প্রশাসনে তাঁর কর্মজীবন শুরু করেন। তিনি সহকারী কমিশনার, সহকারী কমিশনার (ভূমি), প্রথম শ্রেণী ম্যাজিস্ট্রেট, উপজেলা নির্বাহী অফিসার হিসেবে দায়িত্ব পালন করেছেন। তিনি অত্যন্ত দক্ষতা ও সুনামের সাথে জেলা প্রশাসক হিসেবে গাজীপুরে দায়িত্ব পালন করেছেন। তিনি প্রধানমন্ত্রীর কার্যালয়ের পরিচালক (প্রশাসন) হিসেবেও সুনামের সাথে দায়িত্বভার পালন করেছেন।    তিনি সরকারি কাজের অংশ হিসেবে ইউকে, ইউএসএ, অস্ট্রেলিয়া, জার্মানী, ফ্রান্স, তুরস্ক, দক্ষিণ কোরিয়া, জাপানসহ ২০ টির অধিক দেশে ভ্রমণ করেছেন। তিনি ঢাকা বিশ্ববিদ্যালয় হতে জন প্রশাসন বিষয়ে স্নাতক ও স্নাতকোত্তর এবং রাজশাহী বিশ্ববিদ্যালয় হতে পাবলিক পলিসি বিষয়ে পিএইচডি সম্পন্ন করেছেন। তাছাড়াও তিনি দক্ষতা উন্নয়নে দেশে ও বিদেশে অসংখ্য প্রশিক্ষণ কোর্সে অংশ নিয়েছেন। তাঁর প্রকাশিত বেশকিছু বই ও গবেষণা নিবন্ধ রয়েছে।  ডঃ দেওয়ান মুহাম্মদ হুমায়ূন কবীর বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশনের ২০২১-২০২২ মেয়াদে পেশাগত দক্ষতা ও উন্নয়ন উপ-কমিটির আহবায়ক হিসেবে নির্বাচিত হয়েছেন এবং দায়িত্ব পালন করছেন। ",
      photo: "/images/intro/3.jpg",
    },
  ];
  return (
    <div className={style.intro} id="introDiv">
      <InView triggerOnce={true}>
        {({ inView, ref, entry }) => (
          <div ref={ref}>
            <div
              className={
                !inView
                  ? style.introBg
                  : style.introBg + " " + style.startAnimation
              }
            >
              <div
                className={
                  !inView
                    ? style.icon
                    : style.icon + " " + style.startAnimation2
                }
              >
                <Image src={list[index].photo} width={100} height={100} />
              </div>

              <div
                className={
                  !inView
                    ? style.presidentName
                    : style.presidentName + " " + style.startAnimation3
                }
              >
                {list[index].name}
              </div>
              <div
                className={
                  !inView
                    ? style.designation
                    : style.designation + " " + style.startAnimation4
                }
              >
                {list[index].designation}
              </div>

              <div
                className={
                  !inView
                    ? style.details
                    : style.details + " " + style.startAnimation5
                }
              >
                <p>{list[index].details}</p>
              </div>

              <div
                className={
                  !inView
                    ? style.rightMenu
                    : style.rightMenu + " " + style.startAnimation6
                }
              >
                <ul className={style.rightList}>
                  <li
                    className={index === 0 && style.active}
                    onClick={() => setIndex(0)}
                  >
                    <span className={style.listStyle}></span>
                    সভাপতি
                    <div className={style.dotted}></div>
                  </li>
                  <li
                    onClick={() => setIndex(1)}
                    className={index === 1 && style.active}
                  >
                    <span className={style.listStyle}></span>
                    মহাসচিব
                    <div className={style.dotted}></div>
                  </li>
                  <li
                    onClick={() => setIndex(2)}
                    className={index === 2 && style.active}
                  >
                    <span className={style.listStyle}></span>
                    আহবায়ক
                  </li>
                </ul>
              </div>
            </div>
          </div>
        )}
      </InView>
    </div>
  );
}
