/* eslint-disable jsx-a11y/alt-text */
import Image from "next/image";
import { InView, useInView } from "react-intersection-observer";
import style from "./feature.module.scss";
import { useEffect, useState } from "react";

export default function Feature() {
  // const [index, setIndex] = useState(0);
  // const info = [
  //   {
  //     id: 1,
  //     date: "০১ সেপ্টেম্বর, ২০২২",
  //     title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
  //     description:
  //       "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন বিসিএস (প্রশাসন) ক্যাডারের সদস্যগণের প্রতিনিধিত্বকারী একমাত্র এসোসিয়েশন। ১৯ এপ্রিল ১৯৮১ সাল হতে এসোসিয়েশনের কার্যক্রম শুরু করা হয় এবং বিয়াম ফাউন্ডেশন, ৬৩ নিউ ইস্কাটন, ঢাকায় এর সদর দপ্তর স্থাপন করা হয়। জনাব কবির বিন আনোয়ার, সিনিয়র সচিব, পানি সম্পদ মন্ত্রণালয় এসোসিয়েশনের সভাপতি এবং জনাব মোঃ খলিলুর রহমান, সচিব, ডাক ও টেলিযোগাযোগ বিভাগ এসোসিয়েশনের মহাসচিব হিসেবে ২০২১-২০২২ মেয়াদে এসোসিয়েশনের নেতৃত্ব দিয়ে আসছেন। এসোসিয়েশনের কার্যক্রম প্রতিপালনে ৪৫ সদস্য বিশিষ্ট কার্যনির্বাহী কমিটি রয়েছে এবং ৭ টি বিশেষায়িত উপকমিটি রয়েছে। প্রতিটি উপকমিটিতে একজন আহবায়ক ও প্রয়োজনীয় সংখ্যক সদস্য দায়িত্ব পালন করছেন। প্রতিষ্ঠার পর হতেই বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন সদস্যগণের জীবনমান উন্নয়নে বিভিন্ন প্রকল্প ও স্কিম গ্রহণ, সদস্যগণের পেশাগত প্রয়োজনে আইনী সাপোর্ট প্রদান, পারিবারিক প্রয়োজন বা জরুরি চিকিৎসাসহ নানাবিধ কল্যাণমূলক কাজে সহযোগিতা প্রদান করে আসছে। এসোসিয়েশনের কার্যক্রম সচল রাখতে সদস্যগণ বাৎসরিক চাঁদা প্রদান করে থাকেন। সরকারের বিভিন্ন সংস্থা, অন্যান্য সার্ভিস এসোসিয়েশন, পেশাজীবী সংগঠন, সাংবাদিক ও অন্যান্য স্টেকহোল্ডারগণের সাথে নিয়মিত যোগাযোগ এবং সুসম্পর্ক বজায় রাখতে এসোসিয়েশনের অন্যতম গুরুত্বপূর্ণ ভূমিকা পালন করে।",
  //   },
  //   {
  //     id: 2,
  //     date: "০১ সেপ্টেম্বর, ২০২২",
  //     title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
  //     description:
  //       "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন বিসিএস (প্রশাসন) ক্যাডারের সদস্যগণের প্রতিনিধিত্বকারী একমাত্র এসোসিয়েশন। ১৯ এপ্রিল ১৯৮১ সাল হতে এসোসিয়েশনের কার্যক্রম শুরু করা হয় এবং বিয়াম ফাউন্ডেশন, ৬৩ নিউ ইস্কাটন, ঢাকায় এর সদর দপ্তর স্থাপন করা হয়। জনাব কবির বিন আনোয়ার, সিনিয়র সচিব, পানি সম্পদ মন্ত্রণালয় এসোসিয়েশনের সভাপতি এবং জনাব মোঃ খলিলুর রহমান, সচিব, ডাক ও টেলিযোগাযোগ বিভাগ এসোসিয়েশনের মহাসচিব হিসেবে ২০২১-২০২২ মেয়াদে এসোসিয়েশনের নেতৃত্ব দিয়ে আসছেন। এসোসিয়েশনের কার্যক্রম প্রতিপালনে ৪৫ সদস্য বিশিষ্ট কার্যনির্বাহী কমিটি রয়েছে এবং ৭ টি বিশেষায়িত উপকমিটি রয়েছে। প্রতিটি উপকমিটিতে একজন আহবায়ক ও প্রয়োজনীয় সংখ্যক সদস্য দায়িত্ব পালন করছেন। প্রতিষ্ঠার পর হতেই বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন সদস্যগণের জীবনমান উন্নয়নে বিভিন্ন প্রকল্প ও স্কিম গ্রহণ, সদস্যগণের পেশাগত প্রয়োজনে আইনী সাপোর্ট প্রদান, পারিবারিক প্রয়োজন বা জরুরি চিকিৎসাসহ নানাবিধ কল্যাণমূলক কাজে সহযোগিতা প্রদান করে আসছে। এসোসিয়েশনের কার্যক্রম সচল রাখতে সদস্যগণ বাৎসরিক চাঁদা প্রদান করে থাকেন। সরকারের বিভিন্ন সংস্থা, অন্যান্য সার্ভিস এসোসিয়েশন, পেশাজীবী সংগঠন, সাংবাদিক ও অন্যান্য স্টেকহোল্ডারগণের সাথে নিয়মিত যোগাযোগ এবং সুসম্পর্ক বজায় রাখতে এসোসিয়েশনের অন্যতম গুরুত্বপূর্ণ ভূমিকা পালন করে।",
  //   },
  //   {
  //     id: 3,
  //     date: "০১ সেপ্টেম্বর, ২০২২",
  //     title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
  //     description:
  //       "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন বিসিএস (প্রশাসন) ক্যাডারের সদস্যগণের প্রতিনিধিত্বকারী একমাত্র এসোসিয়েশন। ১৯ এপ্রিল ১৯৮১ সাল হতে এসোসিয়েশনের কার্যক্রম শুরু করা হয় এবং বিয়াম ফাউন্ডেশন, ৬৩ নিউ ইস্কাটন, ঢাকায় এর সদর দপ্তর স্থাপন করা হয়। জনাব কবির বিন আনোয়ার, সিনিয়র সচিব, পানি সম্পদ মন্ত্রণালয় এসোসিয়েশনের সভাপতি এবং জনাব মোঃ খলিলুর রহমান, সচিব, ডাক ও টেলিযোগাযোগ বিভাগ এসোসিয়েশনের মহাসচিব হিসেবে ২০২১-২০২২ মেয়াদে এসোসিয়েশনের নেতৃত্ব দিয়ে আসছেন। এসোসিয়েশনের কার্যক্রম প্রতিপালনে ৪৫ সদস্য বিশিষ্ট কার্যনির্বাহী কমিটি রয়েছে এবং ৭ টি বিশেষায়িত উপকমিটি রয়েছে। প্রতিটি উপকমিটিতে একজন আহবায়ক ও প্রয়োজনীয় সংখ্যক সদস্য দায়িত্ব পালন করছেন। প্রতিষ্ঠার পর হতেই বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন সদস্যগণের জীবনমান উন্নয়নে বিভিন্ন প্রকল্প ও স্কিম গ্রহণ, সদস্যগণের পেশাগত প্রয়োজনে আইনী সাপোর্ট প্রদান, পারিবারিক প্রয়োজন বা জরুরি চিকিৎসাসহ নানাবিধ কল্যাণমূলক কাজে সহযোগিতা প্রদান করে আসছে। এসোসিয়েশনের কার্যক্রম সচল রাখতে সদস্যগণ বাৎসরিক চাঁদা প্রদান করে থাকেন। সরকারের বিভিন্ন সংস্থা, অন্যান্য সার্ভিস এসোসিয়েশন, পেশাজীবী সংগঠন, সাংবাদিক ও অন্যান্য স্টেকহোল্ডারগণের সাথে নিয়মিত যোগাযোগ এবং সুসম্পর্ক বজায় রাখতে এসোসিয়েশনের অন্যতম গুরুত্বপূর্ণ ভূমিকা পালন করে।",
  //   },
  //   {
  //     id: 4,
  //     date: "০১ সেপ্টেম্বর, ২০২২",
  //     title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
  //     description:
  //       "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন বিসিএস (প্রশাসন) ক্যাডারের সদস্যগণের প্রতিনিধিত্বকারী একমাত্র এসোসিয়েশন। ১৯ এপ্রিল ১৯৮১ সাল হতে এসোসিয়েশনের কার্যক্রম শুরু করা হয় এবং বিয়াম ফাউন্ডেশন, ৬৩ নিউ ইস্কাটন, ঢাকায় এর সদর দপ্তর স্থাপন করা হয়। জনাব কবির বিন আনোয়ার, সিনিয়র সচিব, পানি সম্পদ মন্ত্রণালয় এসোসিয়েশনের সভাপতি এবং জনাব মোঃ খলিলুর রহমান, সচিব, ডাক ও টেলিযোগাযোগ বিভাগ এসোসিয়েশনের মহাসচিব হিসেবে ২০২১-২০২২ মেয়াদে এসোসিয়েশনের নেতৃত্ব দিয়ে আসছেন। এসোসিয়েশনের কার্যক্রম প্রতিপালনে ৪৫ সদস্য বিশিষ্ট কার্যনির্বাহী কমিটি রয়েছে এবং ৭ টি বিশেষায়িত উপকমিটি রয়েছে। প্রতিটি উপকমিটিতে একজন আহবায়ক ও প্রয়োজনীয় সংখ্যক সদস্য দায়িত্ব পালন করছেন। প্রতিষ্ঠার পর হতেই বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন সদস্যগণের জীবনমান উন্নয়নে বিভিন্ন প্রকল্প ও স্কিম গ্রহণ, সদস্যগণের পেশাগত প্রয়োজনে আইনী সাপোর্ট প্রদান, পারিবারিক প্রয়োজন বা জরুরি চিকিৎসাসহ নানাবিধ কল্যাণমূলক কাজে সহযোগিতা প্রদান করে আসছে। এসোসিয়েশনের কার্যক্রম সচল রাখতে সদস্যগণ বাৎসরিক চাঁদা প্রদান করে থাকেন। সরকারের বিভিন্ন সংস্থা, অন্যান্য সার্ভিস এসোসিয়েশন, পেশাজীবী সংগঠন, সাংবাদিক ও অন্যান্য স্টেকহোল্ডারগণের সাথে নিয়মিত যোগাযোগ এবং সুসম্পর্ক বজায় রাখতে এসোসিয়েশনের অন্যতম গুরুত্বপূর্ণ ভূমিকা পালন করে।",
  //   },
  // ];

  // const setIndexNew = (number) => {
  //   setIndex(number);
  // };

  return (
    <div className={style.feature}>
      <InView>
        {({ inView, ref, entry }) => (
          <div ref={ref}>
            <div
              className={
                !inView
                  ? style.innerBg
                  : style.innerBg + " " + style.startAnimation
              }
            >
              <div
                className={
                  !inView
                    ? style.leftTop
                    : style.leftTop + " " + style.startAnimationLeftTop
                }
              >
                <a href="#" target="_blank">
                  <div
                    className={
                      style.leftTopContent
                      // style.leftTopContent + " " + (!index && style.activeMenu)
                    }
                    //  onClick={() => setIndexNew(0)}
                  >
                    <i className="fa fa-users"></i>
                    <p>
                      {" "}
                      জনকল্যাণে <br /> এ্যাসোসিয়েশন{" "}
                    </p>
                  </div>
                </a>
              </div>

              <div
                className={
                  !inView
                    ? style.right
                    : style.right + " " + style.startAnimationRight
                }
              >
                <a href="#" target="_blank">
                  <div
                    className={style.rightContent}
                    // onClick={() => setIndexNew(1)}
                  >
                    <i className="fa-solid fa-book"></i>
                    <p> ই-লাইব্রেরী </p>
                  </div>
                </a>
              </div>

              <div
                className={
                  !inView
                    ? style.left
                    : style.left + " " + style.startAnimationLeft
                }
              >
                <a href="#" target="_blank">
                  <div
                    className={style.leftContent}
                    //  onClick={() => setIndexNew(2)}
                  >
                    <i class="fa-solid fa-users-viewfinder"></i>
                    <p> সদস্য তালিকা </p>
                  </div>
                </a>
              </div>

              <div
                className={
                  !inView
                    ? style.bottomRight
                    : style.bottomRight + " " + style.startAnimationbottomRight
                }
              >
                <a href="#" target="_blank">
                  <div
                    className={style.bottomRightContent}
                    //  onClick={() => setIndexNew(3)}
                  >
                    <i class="fa-solid fa-users-gear"></i>
                    <p> কার্যনির্বাহী কমিটি </p>
                  </div>
                </a>
              </div>
            </div>

            {/* <div
              className={
                !inView
                  ? style.featureDate
                  : style.featureDate + " " + style.featureDateAm
              }
            >
               {info[index].date}
              ই-লাইব্রেরী
            </div>
            <div
              className={
                !inView
                  ? style.featureTitle
                  : style.featureTitle + " " + style.featureTitleAm
              }
            >
               {info[index].title} 
            </div>
            <div
              className={
                !inView
                  ? style.featureDescription
                  : style.featureDescription + " " + style.featureDescriptionAm
              }
            >
             {info[index].description}
            </div>
            <div
              className={
                !inView
                  ? style.featureReadMore
                  : style.featureReadMore + " " + style.featureReadMoreAm
              }
            >
              <a href="#" target="_blank">
                বিস্তারিত
              </a>
            </div> */}

            <div
              className={
                !inView
                  ? style.featureHeading
                  : style.featureHeading + " " + style.featureDateAm
              }
            >
              ই-লাইব্রেরী
            </div>

            <ul
              className={
                !inView
                  ? style.committeeList
                  : style.committeeList + " " + style.featureDateAm
              }
            >
              <li>
                {/*  next time  change to URL */}
                <a href="javascript:void(0)"> কেন্দ্রীয় কমিটি </a>
              </li>
              <li>
                <a href="javascript:void(0)"> বিভাগীয় কমিটি </a>
              </li>
              <li>
                <a href="javascript:void(0)"> জেলা কমিটি </a>
              </li>
              <li>
                <a href="javascript:void(0)"> ব্যাচভিত্তিক কমিটি </a>
              </li>
            </ul>
          </div>
        )}
      </InView>
    </div>
  );
}
