/* eslint-disable jsx-a11y/alt-text */
import Image from "next/image";
import { InView, useInView } from "react-intersection-observer";
import style from "./feature.module.scss";
import { useEffect, useState } from "react";

export default function Feature() {
  const [index, setIndex] = useState(0);
  const info = [
    {
      id: 1,
      date: "০১ সেপ্টেম্বর, ২০২২",
      title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
      description:
        "দক্ষতা উন্নয়ন, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর।। দক্ষতা উন্নয়ন, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর ...",
    },
    {
      id: 2,
      date: "১০ সেপ্টেম্বর, ২০২২",
      title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
      description:
        " ই-লাইব্রেরী, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর দক্ষতা উন্নয়ন, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর।। ...",
    },
    {
      id: 3,
      date: "১১ সেপ্টেম্বর, ২০২২",
      title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
      description:
        "ব্লগ, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর দক্ষতা উন্নয়ন, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর।। ...",
    },
    {
      id: 4,
      date: "২৫ সেপ্টেম্বর, ২০২২",
      title: "বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন",
      description:
        "ইভেন্টস, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর দক্ষতা উন্নয়ন, বাংলাদেশের জনপ্রশাসন আপনার পাশে সর্বক্ষণ এই মুলমন্ত্রকে সামনে রেখে প্রশাসন ক্যাডারের জনসেবামূলক কর্মকান্ডের মুখপত্র অনলাইন নিউজ পোর্টাল সুশাসন বাতায়ন গত ১৮ ডিসেম্বর ২০২১ তারিখে উদ্বোধন করা হয়। বাংলাদেশ অ্যাডমিনিস্ট্রেটিভ সার্ভিস এসোসিয়েশন এর সভাপতি ও পানিসম্পদ মন্ত্রণালয়ের সিনিয়র সচিব জনাব কবির বিন আনোয়ার এসোসিয়েশানের বার্ষিক সাধারণ সভায় এক অনাড়নম্বর অনুষ্ঠানে এই অনলাইন নিউজ পোর্টালটির উদ্বোধন কর।। ...",
    },
  ];

  const setIndexNew = (number) => {
    setIndex(number);
  };

  return (
    <div className={style.feature}>
      <InView>
        {({ inView, ref, entry }) => (
          <div ref={ref}>
            <div
              className={
                !inView
                  ? style.innerBg
                  : style.innerBg + " " + style.startAnimation
              }
            >
              <div
                className={
                  !inView
                    ? style.leftTop
                    : style.leftTop + " " + style.startAnimationLeftTop
                }
              >
                <div
                  className={
                    style.leftTopContent + " " + (!index && style.activeMenu)
                  }
                  onClick={() => setIndexNew(0)}
                >
                  <i className="fa-solid fa-book"></i>
                  <p> দক্ষতা উন্নয়ন </p>
                </div>
              </div>

              <div
                className={
                  !inView
                    ? style.right
                    : style.right + " " + style.startAnimationRight
                }
              >
                <div
                  className={
                    style.rightContent + " " + (index == 1 && style.activeMenu)
                  }
                  onClick={() => setIndexNew(1)}
                >
                  <i className="fa-solid fa-book"></i>
                  <p> ই-লাইব্রেরী </p>
                </div>
              </div>
              <div
                className={
                  !inView
                    ? style.left
                    : style.left + " " + style.startAnimationLeft
                }
              >
                <div
                  className={
                    style.leftContent + " " + (index == 2 && style.activeMenu)
                  }
                  onClick={() => setIndexNew(2)}
                >
                  <i className="fa-solid fa-book"></i>
                  <p> ব্লগ </p>
                </div>
              </div>

              <div
                className={
                  !inView
                    ? style.bottomRight
                    : style.bottomRight + " " + style.startAnimationbottomRight
                }
              >
                <div
                  className={
                    style.bottomRightContent +
                    " " +
                    (index == 3 && style.activeMenu)
                  }
                  onClick={() => setIndexNew(3)}
                >
                  <i className="fa-solid fa-book"></i>
                  <p> কার্যনির্বাহী কমিটি </p>
                </div>
              </div>
            </div>

            <div
              className={
                !inView
                  ? style.featureDate
                  : style.featureDate + " " + style.featureDateAm
              }
            >
              {info[index].date}
            </div>
            <div
              className={
                !inView
                  ? style.featureTitle
                  : style.featureTitle + " " + style.featureTitleAm
              }
            >
              {info[index].title}
            </div>
            <div
              className={
                !inView
                  ? style.featureDescription
                  : style.featureDescription + " " + style.featureDescriptionAm
              }
            >
              {info[index].description}
            </div>
            <div
              className={
                !inView
                  ? style.featureReadMore
                  : style.featureReadMore + " " + style.featureReadMoreAm
              }
            >
              <a>আরও পড়ুন</a>
            </div>
          </div>
        )}
      </InView>
    </div>
  );
}
